app/Controllers/Dashboard.php

    public function index()
    {
        $session = session();
        if($session->has("userdata")) {
            $userdata = $session->get('userdata');
            if($userdata['role'] == 1 || $userdata['role'] == 2) {
                $data["mode_labels"] = [];
                $data["mode_values"] = [];

                $db = db_connect();
                $sql = "SELECT spm.id, spm.name,SUM(se.amount) AS total FROM  salon_payment_modes spm LEFT JOIN  salon_cover_entries se ON se.payment_mode_id = spm.id WHERE  spm.is_active = 1  AND spm.deleted_at IS NULL GROUP BY spm.id, spm.name";
                $query = $db->query($sql);
                $result = $query->getResult();
                if($result) {
                    foreach($result as $row) {
                        $data["mode_labels"][] = $row->name;
                        $data["mode_values"][] = $row->total;
                    }
                }
                $model = new Salon;
                $data["salons"] = $model->select("id,name,currency")->where("is_active",1)->where("deleted_at IS NULL")->orderBy("id","asc")->get()->getResultArray();
---
SELECT `id`, `name`, `currency`
FROM `salons`
WHERE `is_active` = 1
AND `deleted_at` IS NULL
ORDER BY `id` ASC