app/Controllers/Staffs.php

    public function index()
    {
        $session = session();
        if($session->has("userdata")) {
            if(check_permission('staff')) {
                $db = db_connect();
                $result = $db->table("salon_users su");
                $result = $result->join("salons s","s.id=su.salon_id");
                $result = $result->select("su.*,s.name AS salon,s.currency");
                $result = $result->where("su.deleted_at IS NULL");
                $result = $result->where("su.role",3);
                $result = $result->orderBy("su.id","desc");
                $data["staffs"] = $result->get()->getResultArray();
---
SELECT `su`.*, `s`.`name` AS `salon`, `s`.`currency`
FROM `salon_users` `su`
JOIN `salons` `s` ON `s`.`id`=`su`.`salon_id`
WHERE `su`.`deleted_at` IS NULL
AND `su`.`role` = 3
ORDER BY `su`.`id` DESC